# Introduction 
### This is a simple how to deploy machine learning model with flask. The basic are covered on how to get you started with model deployment in a simple form.

# Business Understanding 
### We are going to predict the outcome of the passengers who survived the  titanic shipwreck diasater. We are only using the titanic train dataset from Kaggle

In [1]:
## import the packages
import numpy as np 
import pandas as pd

In [2]:
train_data = pd.read_csv("train.csv")

In [3]:
## check the data
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### From the dataset above we can see we have 12 features , But for the purpose of model deployment we'll be using only four features. The important feature include; Survived, Age,Sex, Embarked.

In [4]:
## Creating a dataframe for our four features only 
final_data = ["Survived", "Age", "Sex", "Embarked"]
data = train_data[final_data]

In [5]:
## check the data again 
data.head()

   Survived   Age     Sex Embarked
0         0  22.0    male        S
1         1  38.0  female        C
2         1  26.0  female        S
3         1  35.0  female        S
4         0  35.0    male        S

### we can see we  only have the four features needed for the modelling and prediction

In [7]:
## check for missing values 
data.isnull().sum()

Survived      0
Age         177
Sex           0
Embarked      2
dtype: int64

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Survived    891 non-null int64
Age         714 non-null float64
Sex         891 non-null object
Embarked    889 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 28.0+ KB

### As we can see from our data.info, we have missing values in Age and Embarked as well. The next step is to fill the missing values

In [19]:
## fill the missing values 
data["Age"] = data["Age"].fillna(0)
data["Age"] = data["Age"].astype(int)
data["Embarked"] = data["Embarked"].fillna("S")

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [18]:
## check to confirm missing values
data.isnull().sum()

Survived    0
Age         0
Sex         0
Embarked    0
dtype: int64

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Survived    891 non-null int64
Age         891 non-null int32
Sex         891 non-null object
Embarked    891 non-null object
dtypes: int32(1), int64(1), object(2)
memory usage: 24.5+ KB

In [21]:
data.head(10)

   Survived  Age     Sex Embarked
0         0   22    male        S
1         1   38  female        C
2         1   26  female        S
3         1   35  female        S
4         0   35    male        S
5         0    0    male        Q
6         0   54    male        S
7         0    2    male        S
8         1   27  female        S
9         1   14  female        C

### As we can see, we've handled missing values perfectly, next step is to convert categories features using onehotencoding

In [23]:
## converting categorical features 
data = pd.get_dummies(data, dummy_na=True)

In [27]:
data.tail(10)

,Survived,Age,Sex_female,Sex_male,Sex_nan,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
881,0,33,0,1,0,0,0,1,0
882,0,22,1,0,0,0,0,1,0
883,0,28,0,1,0,0,0,1,0
884,0,25,0,1,0,0,0,1,0
885,0,39,1,0,0,0,1,0,0
886,0,27,0,1,0,0,0,1,0
887,1,19,1,0,0,0,0,1,0
888,0,0,1,0,0,0,0,1,0
889,1,26,0,1,0,1,0,0,0
890,0,32,0,1,0,0,1,0,0

In [28]:
## dropping the sex_nan and embarked_nan features 
data = data.drop(["Sex_nan"], axis=1)
data = data.drop(["Embarked_nan"], axis=1)

In [29]:
## check the data again 
data.head()

   Survived  Age  Sex_female  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0         0   22           0         1           0           0           1
1         1   38           1         0           1           0           0
2         1   26           1         0           0           0           1
3         1   35           1         0           0           0           1
4         0   35           0         1           0           0           1

# Modelling and Predicting

In [32]:
## features and target
target = "Survived"
features = ["Age", "Sex_female", "Sex_male", "Embarked_C", "Embarked_Q", "Embarked_S"]

In [33]:
X = data[features]
y = data[target]

In [34]:
## splitting the data into training and test 
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [36]:
## we'll be using logistic regression for the prediction 
from sklearn.linear_model import LogisticRegression
logreg = LogisticRegression()
logreg.fit(X_train, y_train)

Y_pred = logreg.predict(X_test)

C:\Users\user\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [38]:
from sklearn.metrics import accuracy_score 
print ("Logistic Regression\nAccuracy is ", 
             accuracy_score(y_test, Y_pred)*100 )

Logistic Regression
Accuracy is  78.77094972067039

### We are good to go, the next step is to save our model in a pickle file

In [39]:
import pickle 
pickle.dump(logreg, open('model.pkl', 'wb'))

In [40]:
##load the model
model = pickle.load(open('model.pkl','rb'))
model

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

## Some adjustments will be made due to some errors made in the notebook.


# Arigato :)